{
  "title": "Welcome to Builder",
  "slug": "onboarding",
  "description": "Everything you need to know to get started with Builder meetups and the global Bitcoin builder community.",
  "sections": [
    {
      "title": "Getting Started",
      "body": "Builder welcomes everyone interested in Bitcoin, from complete beginners to experienced developers. Our global network of chapters is built on collaboration, learning, and building together. Find a chapter near you or connect with builders worldwide."
    },
    {
      "title": "Before Your First Meetup",
      "body": "No preparation required! However, if you'd like to get a head start, we recommend reviewing our Bitcoin 101 guide and What to Expect page. Bring your curiosity, questions, and laptop if you plan to participate in workshops.",
      "links": [
        {
          "text": "Bitcoin 101",
          "url": "/bitcoin-101",
          "external": false
        },
        {
          "text": "What to Expect",
          "url": "/what-to-expect",
          "external": false
        }
      ]
    },
    {
      "title": "Community Guidelines",
      "body": "Builder is an inclusive, respectful global community. We welcome all experience levels and backgrounds. Be kind, ask questions, share knowledge, and help others learn. All meetups follow the Chatham House Rule for open discussion. These guidelines apply across all Builder chapters worldwide."
    },
    {
      "title": "Stay Connected",
      "body": "Join your local chapter's community channels to stay updated on events, technical discussions, and announcements. Follow Builder chapters on social media and connect with the global network. Each chapter operates independently while sharing knowledge across the network."
    }
  ],
  "meta": {
    "title": "Onboarding | Builder Network",
    "description": "Get started with Builder. Learn what to expect and how to join the global Bitcoin builder community.",
    "keywords": [
      "onboarding",
      "getting started",
      "builder network",
      "bitcoin community",
      "chapters"
    ]
  }
}
